Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
vggface_resnet50 (Model)        multiple             23561152    input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
global_max_pooling2d_1 (GlobalM (None, 2048)         0           vggface_resnet50[1][0]           
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 2048)         0           vggface_resnet50[1][0]           
__________________________________________________________________________________________________
global_max_pooling2d_2 (GlobalM (None, 2048)         0           vggface_resnet50[2][0]           
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 2048)         0           vggface_resnet50[2][0]           
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 4096)         0           global_max_pooling2d_1[0][0]     
                                                                 global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 4096)         0           global_max_pooling2d_2[0][0]     
                                                                 global_average_pooling2d_2[0][0] 
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 4096)         0           concatenate_1[0][0]              
                                                                 concatenate_1[0][0]              
__________________________________________________________________________________________________
multiply_3 (Multiply)           (None, 4096)         0           concatenate_2[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
subtract_1 (Subtract)           (None, 4096)         0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
subtract_2 (Subtract)           (None, 4096)         0           multiply_2[0][0]                 
                                                                 multiply_3[0][0]                 
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 4096)         0           subtract_1[0][0]                 
                                                                 subtract_1[0][0]                 
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 1)            0           subtract_2[0][0]                 
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 1)            0           multiply_1[0][0]                 
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 1)            0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 8195)         0           lambda_3[0][0]                   
                                                                 lambda_2[0][0]                   
                                                                 lambda_1[0][0]                   
                                                                 subtract_2[0][0]                 
                                                                 multiply_1[0][0]                 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 200)          1639200     concatenate_3[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 200)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 50)           10050       dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            51          dense_2[0][0]                    
==================================================================================================
Total params: 25,210,453
Trainable params: 25,157,333
Non-trainable params: 53,120
__________________________________________________________________________________________________

Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
vggface_resnet50 (Model)        multiple             23561152    input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
global_max_pooling2d_1 (GlobalM (None, 2048)         0           vggface_resnet50[1][0]           
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 2048)         0           vggface_resnet50[1][0]           
__________________________________________________________________________________________________
global_max_pooling2d_2 (GlobalM (None, 2048)         0           vggface_resnet50[2][0]           
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 2048)         0           vggface_resnet50[2][0]           
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 4096)         0           global_max_pooling2d_1[0][0]     
                                                                 global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 4096)         0           global_max_pooling2d_2[0][0]     
                                                                 global_average_pooling2d_2[0][0] 
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 4096)         0           concatenate_1[0][0]              
                                                                 concatenate_1[0][0]              
__________________________________________________________________________________________________
multiply_3 (Multiply)           (None, 4096)         0           concatenate_2[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
subtract_1 (Subtract)           (None, 4096)         0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
subtract_2 (Subtract)           (None, 4096)         0           multiply_2[0][0]                 
                                                                 multiply_3[0][0]                 
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 4096)         0           subtract_1[0][0]                 
                                                                 subtract_1[0][0]                 
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 1)            0           subtract_2[0][0]                 
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 1)            0           multiply_1[0][0]                 
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 1)            0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 8195)         0           lambda_3[0][0]                   
                                                                 lambda_2[0][0]                   
                                                                 lambda_1[0][0]                   
                                                                 subtract_2[0][0]                 
                                                                 multiply_1[0][0]                 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 200)          1639200     concatenate_3[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 200)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 50)           10050       dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            51          dense_2[0][0]                    
==================================================================================================
Total params: 25,210,453
Trainable params: 25,157,333
Non-trainable params: 53,120
__________________________________________________________________________________________________

Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
vggface_resnet50 (Model)        multiple             23561152    input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
global_max_pooling2d_1 (GlobalM (None, 2048)         0           vggface_resnet50[1][0]           
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 2048)         0           vggface_resnet50[1][0]           
__________________________________________________________________________________________________
global_max_pooling2d_2 (GlobalM (None, 2048)         0           vggface_resnet50[2][0]           
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 2048)         0           vggface_resnet50[2][0]           
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 4096)         0           global_max_pooling2d_1[0][0]     
                                                                 global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 4096)         0           global_max_pooling2d_2[0][0]     
                                                                 global_average_pooling2d_2[0][0] 
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 4096)         0           concatenate_1[0][0]              
                                                                 concatenate_1[0][0]              
__________________________________________________________________________________________________
multiply_3 (Multiply)           (None, 4096)         0           concatenate_2[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
subtract_1 (Subtract)           (None, 4096)         0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
subtract_2 (Subtract)           (None, 4096)         0           multiply_2[0][0]                 
                                                                 multiply_3[0][0]                 
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 4096)         0           subtract_1[0][0]                 
                                                                 subtract_1[0][0]                 
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 1)            0           subtract_2[0][0]                 
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 1)            0           multiply_1[0][0]                 
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 1)            0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 8195)         0           lambda_3[0][0]                   
                                                                 lambda_2[0][0]                   
                                                                 lambda_1[0][0]                   
                                                                 subtract_2[0][0]                 
                                                                 multiply_1[0][0]                 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 200)          1639200     concatenate_3[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 200)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 50)           10050       dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            51          dense_2[0][0]                    
==================================================================================================
Total params: 25,210,453
Trainable params: 25,157,333
Non-trainable params: 53,120
__________________________________________________________________________________________________

Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
vggface_resnet50 (Model)        multiple             23561152    input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
global_max_pooling2d_1 (GlobalM (None, 2048)         0           vggface_resnet50[1][0]           
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 2048)         0           vggface_resnet50[1][0]           
__________________________________________________________________________________________________
global_max_pooling2d_2 (GlobalM (None, 2048)         0           vggface_resnet50[2][0]           
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 2048)         0           vggface_resnet50[2][0]           
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 4096)         0           global_max_pooling2d_1[0][0]     
                                                                 global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 4096)         0           global_max_pooling2d_2[0][0]     
                                                                 global_average_pooling2d_2[0][0] 
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 4096)         0           concatenate_1[0][0]              
                                                                 concatenate_1[0][0]              
__________________________________________________________________________________________________
multiply_3 (Multiply)           (None, 4096)         0           concatenate_2[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
subtract_1 (Subtract)           (None, 4096)         0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
subtract_2 (Subtract)           (None, 4096)         0           multiply_2[0][0]                 
                                                                 multiply_3[0][0]                 
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 4096)         0           subtract_1[0][0]                 
                                                                 subtract_1[0][0]                 
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 1)            0           subtract_2[0][0]                 
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 1)            0           multiply_1[0][0]                 
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 1)            0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 8195)         0           lambda_3[0][0]                   
                                                                 lambda_2[0][0]                   
                                                                 lambda_1[0][0]                   
                                                                 subtract_2[0][0]                 
                                                                 multiply_1[0][0]                 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 200)          1639200     concatenate_3[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 200)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 50)           10050       dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            51          dense_2[0][0]                    
==================================================================================================
Total params: 25,210,453
Trainable params: 25,157,333
Non-trainable params: 53,120
__________________________________________________________________________________________________

Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
vggface_resnet50 (Model)        multiple             23561152    input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
global_max_pooling2d_1 (GlobalM (None, 2048)         0           vggface_resnet50[1][0]           
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 2048)         0           vggface_resnet50[1][0]           
__________________________________________________________________________________________________
global_max_pooling2d_2 (GlobalM (None, 2048)         0           vggface_resnet50[2][0]           
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 2048)         0           vggface_resnet50[2][0]           
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 4096)         0           global_max_pooling2d_1[0][0]     
                                                                 global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 4096)         0           global_max_pooling2d_2[0][0]     
                                                                 global_average_pooling2d_2[0][0] 
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 4096)         0           concatenate_1[0][0]              
                                                                 concatenate_1[0][0]              
__________________________________________________________________________________________________
multiply_3 (Multiply)           (None, 4096)         0           concatenate_2[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
subtract_1 (Subtract)           (None, 4096)         0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
subtract_2 (Subtract)           (None, 4096)         0           multiply_2[0][0]                 
                                                                 multiply_3[0][0]                 
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 4096)         0           subtract_1[0][0]                 
                                                                 subtract_1[0][0]                 
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 1)            0           subtract_2[0][0]                 
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 1)            0           multiply_1[0][0]                 
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 1)            0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 8195)         0           lambda_3[0][0]                   
                                                                 lambda_2[0][0]                   
                                                                 lambda_1[0][0]                   
                                                                 subtract_2[0][0]                 
                                                                 multiply_1[0][0]                 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 200)          1639200     concatenate_3[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 200)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 50)           10050       dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            51          dense_2[0][0]                    
==================================================================================================
Total params: 25,210,453
Trainable params: 25,157,333
Non-trainable params: 53,120
__________________________________________________________________________________________________

Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
vggface_resnet50 (Model)        multiple             23561152    input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
global_max_pooling2d_1 (GlobalM (None, 2048)         0           vggface_resnet50[1][0]           
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 2048)         0           vggface_resnet50[1][0]           
__________________________________________________________________________________________________
global_max_pooling2d_2 (GlobalM (None, 2048)         0           vggface_resnet50[2][0]           
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 2048)         0           vggface_resnet50[2][0]           
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 4096)         0           global_max_pooling2d_1[0][0]     
                                                                 global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 4096)         0           global_max_pooling2d_2[0][0]     
                                                                 global_average_pooling2d_2[0][0] 
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 4096)         0           concatenate_1[0][0]              
                                                                 concatenate_1[0][0]              
__________________________________________________________________________________________________
multiply_3 (Multiply)           (None, 4096)         0           concatenate_2[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
subtract_1 (Subtract)           (None, 4096)         0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
subtract_2 (Subtract)           (None, 4096)         0           multiply_2[0][0]                 
                                                                 multiply_3[0][0]                 
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 4096)         0           subtract_1[0][0]                 
                                                                 subtract_1[0][0]                 
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 1)            0           subtract_2[0][0]                 
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 1)            0           multiply_1[0][0]                 
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 1)            0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 8195)         0           lambda_3[0][0]                   
                                                                 lambda_2[0][0]                   
                                                                 lambda_1[0][0]                   
                                                                 subtract_2[0][0]                 
                                                                 multiply_1[0][0]                 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 200)          1639200     concatenate_3[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 200)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 50)           10050       dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            51          dense_2[0][0]                    
==================================================================================================
Total params: 25,210,453
Trainable params: 25,157,333
Non-trainable params: 53,120
__________________________________________________________________________________________________

Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
vggface_resnet50 (Model)        multiple             23561152    input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
global_max_pooling2d_1 (GlobalM (None, 2048)         0           vggface_resnet50[1][0]           
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 2048)         0           vggface_resnet50[1][0]           
__________________________________________________________________________________________________
global_max_pooling2d_2 (GlobalM (None, 2048)         0           vggface_resnet50[2][0]           
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 2048)         0           vggface_resnet50[2][0]           
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 4096)         0           global_max_pooling2d_1[0][0]     
                                                                 global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 4096)         0           global_max_pooling2d_2[0][0]     
                                                                 global_average_pooling2d_2[0][0] 
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 4096)         0           concatenate_1[0][0]              
                                                                 concatenate_1[0][0]              
__________________________________________________________________________________________________
multiply_3 (Multiply)           (None, 4096)         0           concatenate_2[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
subtract_1 (Subtract)           (None, 4096)         0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
subtract_2 (Subtract)           (None, 4096)         0           multiply_2[0][0]                 
                                                                 multiply_3[0][0]                 
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 4096)         0           subtract_1[0][0]                 
                                                                 subtract_1[0][0]                 
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 1)            0           subtract_2[0][0]                 
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 1)            0           multiply_1[0][0]                 
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 1)            0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 8195)         0           lambda_3[0][0]                   
                                                                 lambda_2[0][0]                   
                                                                 lambda_1[0][0]                   
                                                                 subtract_2[0][0]                 
                                                                 multiply_1[0][0]                 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 200)          1639200     concatenate_3[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 200)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 50)           10050       dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            51          dense_2[0][0]                    
==================================================================================================
Total params: 25,210,453
Trainable params: 25,157,333
Non-trainable params: 53,120
__________________________________________________________________________________________________

